cask_args appdir: '/Applications'

tap 'homebrew/core'
tap 'homebrew/cask-versions'
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'heroku/brew'
tap 'isen-ng/dotnet-sdk-versions'
tap 'kolmafia/homebrew-kolmafia'

brew 'ack' # alternative to grep
brew 'act' # lets you test github actions locally
brew 'adns'
brew 'ansible'
brew 'autoconf'
brew 'automake'
brew 'amazon-ecs-cli'
brew 'certbot'
brew 'cocoapods'
brew 'composer' # PHP dependency management
brew 'direnv' # Used to auto-load .env files
brew 'docker'
brew 'docker-compose'
brew 'fileicon' # Used to assign custom file icons to files / folders
brew 'ghostscript'
brew 'git'
brew 'git-svn'
brew 'gnupg'
brew 'helm'
brew 'heroku'
brew 'htop'
brew 'hub'
brew 'hyperkit' # Used for docker / minikube
brew 'imagemagick'
brew 'jenv'
brew 'kubernetes-cli'
brew 'kubeseal'
brew 'lame' # mp3 encoder, needed for audacity
brew 'libevent'
brew 'libtiff'
brew 'mas'
brew 'maven'
brew 'minikube'
brew 'mysql-client'
brew 'nvm' # we used to install node directly, like scrubs.
brew 'openssl'
brew 'openvpn'
brew 'packer'
brew 'pass'
brew 'postgresql'
brew 'pyenv'
brew 'rbenv'
brew 'redis'
brew 'ruby'
brew 'subversion'
brew 'sqlite'
brew 'terraform'
brew 'tesseract'
brew 'vim'
brew 'wget'
brew 'xpdf'
brew 'yarn'
brew 'z'
brew 'zsh'
brew 'zsh-completions'

# Applications
cask 'ableton-live-suite'
cask 'audio-hijack'
cask 'alfred'
cask 'android-studio'
cask 'balenaetcher'
cask 'battle-net'
cask 'balsamiq-wireframes'
cask 'bitwarden'
cask 'brave-browser'
cask 'chromium' --no-quarantine
cask 'clockify'
cask 'cyberduck'
cask 'discord'
cask 'dotnet-sdk3-1-400'
cask 'dungeon-crawl-stone-soup-tiles'
cask 'eclipse-java'
cask 'element'
cask 'firefox'
cask 'fission'
cask 'fluid'
cask 'flux'
cask 'google-chrome'
cask 'google-cloud-sdk'
cask 'iterm2'
cask 'temurin' # This is java (https://adoptium.net/)
cask 'kolmafia'
cask 'little-snitch'
cask 'loopback'
cask 'maestral'
cask 'micro-snitch'
cask 'microsoft-office'
cask 'obs'
cask 'omnifocus'
cask 'omnigraffle'
cask 'omnioutliner'
cask 'omniplan'
cask 'postman'
cask 'qbserve'
cask 'quicken'
cask 'rectangle'
cask 'signal'
cask 'slack'
cask 'steam'
cask 'steamcmd'
cask 'soundsource'
cask 'splice'
cask 'spotify'
cask 'swinsian'
cask 'transmit'
cask 'tor-browser'
cask 'tweetbot'
cask 'vagrant'
cask 'versions'
cask 'vagrant'
cask 'virtualbox'
cask 'vlc'
cask 'vscodium'
cask 'zulip'
cask 'zoom'
cask 'zotero'

# Fonts
cask 'font-fira-code'
cask 'font-inconsolata'
cask 'font-source-code-pro'
cask 'font-open-sans'
cask 'font-overpass'
