cask_args appdir: '/Applications'

tap 'homebrew/core'
tap 'homebrew/cask-versions'
tap 'caskroom/cask'
tap 'caskroom/fonts'

brew 'ack' # alternative to grep
brew 'adns'
brew 'autoconf'
brew 'automake'
brew 'git'
brew 'gnupg'
brew 'heroku'
brew 'heroku-toolbelt'
brew 'htop'
brew 'hub'
brew 'imagemagick'
brew 'lame' # mp3 encoder, needed for audacity
brew 'libevent'
brew 'mas'
brew 'node'
brew 'jenv'
brew 'openssl'
brew 'postgresql'
brew 'python'
brew 'python2'
brew 'ruby'
brew 'sqlite'
brew 'vim'
brew 'wget'
brew 'yarn'
brew 'z'
brew 'zsh'
brew 'zsh-completions'

# Applications
cask '1password'
cask 'ableton-live-suite'
cask 'audio-hijack'
cask 'alfred'
cask 'android-studio'
cask 'battle-net'
cask 'balsamiq-mockups'
cask 'busycal'
cask 'busycontacts'
cask 'colloquy'
cask 'cyberduck'
cask 'daisydisk'
cask 'discord'
cask 'divvy'
cask 'docker'
cask 'dropbox'
cask 'eclipse-java'
cask 'firefox'
cask 'fission'
cask 'fluid'
cask 'flux'
cask 'geekbench'
cask 'google-chrome'
cask 'google-backup-and-sync'
cask 'harvest'
cask 'iterm2'
cask 'java'
cask 'java8'
cask 'little-snitch'
cask 'loopback'
cask 'micro-snitch'
cask 'microsoft-office'
cask 'obs'
cask 'omnifocus'
cask 'omnigraffle'
cask 'omnioutliner'
cask 'omniplan'
cask 'qbserve'
cask 'quicken'
cask 'screenflow'
cask 'signal'
cask 'slack'
cask 'steam'
cask 'sublime-text'
cask 'splice'
cask 'spotify'
cask 'tomighty'
cask 'tor-browser'
cask 'vagrant'
cask 'versions'
cask 'vlc'
cask 'zulip'
cask 'zoomus'

# Fonts
cask 'font-fira-code'
cask 'font-hermit'
cask 'font-inconsolata'
cask 'font-inconsolata-for-powerline'
cask 'font-source-code-pro'
cask 'font-open-sans'