cask_args appdir: '/Applications'

tap 'homebrew/core'
tap 'homebrew/cask-versions'
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'heroku/brew'

brew 'ack' # alternative to grep
brew 'adns'
brew 'ansible'
brew 'autoconf'
brew 'automake'
brew 'amazon-ecs-cli'
brew 'certbot'
brew 'ghostscript'
brew 'git'
brew 'gnupg'
brew 'heroku'
brew 'heroku-toolbelt'
brew 'htop'
brew 'hub'
brew 'imagemagick'
brew 'jenv'
brew 'lame' # mp3 encoder, needed for audacity
brew 'libevent'
brew 'libtiff'
brew 'mas'
brew 'maven'
brew 'mysql-client'
brew 'nvm' # we used to install node directly, like scrubs.
brew 'openssl'
brew 'packer'
brew 'pass'
brew 'php-version'
brew 'postgresql'
brew 'pyenv'
brew 'rbenv'
brew 'redis'
brew 'ruby'
brew 'subversion'
brew 'sqlite'
brew 'terraform'
brew 'tesseract'
brew 'vim'
brew 'wget'
brew 'xpdf'
brew 'yarn'
brew 'z'
brew 'zsh'
brew 'zsh-completions'

# Applications
cask '1password'
cask 'ableton-live-suite'
cask 'audio-hijack'
cask 'alfred'
cask 'android-studio'
cask 'balenaetcher'
cask 'battle-net'
cask 'balsamiq-mockups'
cask 'colloquy'
cask 'cyberduck'
cask 'daisydisk'
cask 'discord'
cask 'divvy'
cask 'docker'
cask 'dropbox'
cask 'dungeon-crawl-stone-soup-tiles'
cask 'dwarf-fortress-lmp'
cask 'eclipse-java'
cask 'firefox'
cask 'fission'
cask 'fluid'
cask 'flux'
cask 'geekbench'
cask 'google-chrome'
cask 'google-backup-and-sync'
cask 'harvest'
cask 'intellij-idea-ce'
cask 'iterm2'
cask 'java'
cask 'java8'
cask 'keybase'
cask 'little-snitch'
cask 'loopback'
cask 'micro-snitch'
cask 'microsoft-office'
cask 'modelio'
cask 'obs'
cask 'omnifocus'
cask 'omnigraffle'
cask 'omnioutliner'
cask 'omniplan'
cask 'openvpn'
cask 'postman'
cask 'qbserve'
cask 'quicken'
cask 'screenflow'
cask 'signal'
cask 'slack'
cask 'steam'
cask 'sublime-text'
cask 'soundsource'
cask 'splice'
cask 'spotify'
cask 'swinsian'
cask 'transmit'
cask 'tomighty'
cask 'tor-browser'
cask 'vagrant'
cask 'versions'
cask 'vagrant'
cask 'virtualbox'
cask 'vlc'
cask 'zulip'
cask 'zoomus'
cask 'zotero'

# Fonts
cask 'font-fira-code'
cask 'font-hermit'
cask 'font-inconsolata'
cask 'font-inconsolata-for-powerline'
cask 'font-source-code-pro'
cask 'font-open-sans'
cask 'font-overpass'
